EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/reg_pmu.h
/*************************************************************************************************************
 * @file    reg_pmu.h
 * @version V1.1
 * @date    2022-01-10
 * @brief   
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/


#ifndef __REG_PMU_H__
#define __REG_PMU_H__

#ifdef __cplusplus
extern "C" {
#endif

#define PMU_LUT_MAX                        (16)

//=====================================================================================================================
// TYPEDEF STRUCT
//=====================================================================================================================
typedef struct
{
    __IM  uint32_t PMU_LUT_ROW_INT_FLAG;         /* [0x00](RO) */
    __OM  uint32_t PMU_LUT_ROW_INT_CLR;          /* [0x04](WO) */
    __IOM uint32_t PMU_LUT_ROW[PMU_LUT_MAX];     /* [0x08~0x44](RW) */
    __IOM uint32_t PMU_PWR_ON_CFG;               /* [0x48](RW) */
    __IOM uint32_t PMU_CLK_SYNC_OUT;             /* [0x4C](RW) */
    __IOM uint32_t PMU_PWR_OFF_CFG;              /* [0x50](RW) */
    __IOM uint32_t PMU_DCDC_TRIM;                /* [0x54](RW) */
    __IOM uint32_t PMU_PSW_CFG;                  /* [0x58](RW) */
    __IOM uint32_t PMU_DCXO_HCLK_STABLE_TIME;    /* [0x5C](RW) */
    __IOM uint32_t PMU_SRAM_RET_EN;              /* [0x60](RW) */
    __IOM uint32_t PMU_SLEEP_MODE;               /* [0x64](RW) */
    __IOM uint32_t PMU_PD_SYS_RET_CFG;           /* [0x68](RW) */
    __OM  uint32_t PMU_FORCE_SLEEP;              /* [0x6C](WO) */
    __IOM uint32_t PMU_DCDC_ACT_OUT_EN;          /* [0x70](RW) */
    __IOM uint32_t PMU_DCDC_ACT_CFG;             /* [0x74](RW) */
    __IOM uint32_t PMU_DCDC_FB_CFG;              /* [0x78](RW) */
    __IOM uint32_t PMU_DCDC_LPWR_OUT_EN;         /* [0x7C](RW) */
    __IOM uint32_t PMU_DCDC_LPWR_ZCD_CFG;        /* [0x80](RW) */
    __IOM uint32_t PMU_DCDC_LPWR_N_CFG;          /* [0x84](RW) */
    __IOM uint32_t PMU_DCDC_LPWR_CFG;            /* [0x88](RW) */
    __IOM uint32_t PMU_DCDC_LPWR_CLK;            /* [0x8C](RW) */
    __IOM uint32_t PMU_LDO_ACT_OUT_EN;           /* [0x90](RW) */
    __IOM uint32_t PMU_LDO_ACT_CFG;              /* [0x94](RW) */
    __IOM uint32_t PMU_LDO_1V8_OUT_EN;           /* [0x98](RW) */
    __IOM uint32_t PMU_LDO_DIG_OUT_EN;           /* [0x9C](RW) */
    __IOM uint32_t PMU_LDO_DIG_CFG;              /* [0xA0](RW) */
    __IOM uint32_t PMU_LDO_RET_CTRL;             /* [0xA4](RW) */
    __IOM uint32_t PMU_LDO_RET_CFG;              /* [0xA8](RW) */
    __OM  uint32_t PMU_CLK_CTRL;                 /* [0xAC](WO) */
    __IM  uint32_t PMU_CLK_STATUS;               /* [0xB0](RO) */
    __IOM uint32_t PMU_DCXO_HCLK_PWR_SEL;        /* [0xB4](RW) */
    __IOM uint32_t PMU_DCXO_HCLK_CFG;            /* [0xB8](RW) */
    __IOM uint32_t PMU_RC_HCLK_TUNE;             /* [0xBC](RW) */
    __IOM uint32_t PMU_RC_LCLK_TUNE;             /* [0xC0](RW) */
    __IOM uint32_t PMU_PLL_CFG;                  /* [0xC4](RW) */
    __OM  uint32_t PMU_PD_ON;                    /* [0xC8](WO) */
    __OM  uint32_t PMU_PD_OFF;                   /* [0xCC](WO) */
    __IM  uint32_t PMU_DPSW_STATUS;              /* [0xD0](RO) */
    __IOM uint32_t PMU_CODE;                     /* [0xD4](RW) */
    __IOM uint32_t PMU_RET_RESET_SEL;            /* [0xD8](RW) */
    __IOM uint32_t PMU_USB_PHY_SEL;              /* [0xDC](RW) */
    __IOM uint32_t PMU_BAND_GAP_CFG;             /* [0xE0](RW) */
    __IOM uint32_t PMU_ANA_BKUP;                 /* [0xE4](RW) */
    __IOM uint32_t PMU_TEST_CTRL;                /* [0xE8](RW) */
    __IOM uint32_t PMU_FORCE_CTRL;               /* [0xEC](RW) */
    __IOM uint32_t PMU_ANA_BKUP2;                /* [0xF0](RW) */
    __IM  uint32_t PMU_ANA_BKUP_STA;             /* [0xF4](RO) */
    __IM  uint32_t PMU_CDC_CNT;                  /* [0xF8](RO) */

} stPMU_Handle_t, *pstPMU_Handle_t;


//=====================================================================================================================
// [0x00~0x04] PMU_LUT_ROW_INT_FLAG / PMU_LUT_ROW_INT_CLR
//=====================================================================================================================
#define PMU_INT_MSK                        (0x1FFFF)


//=====================================================================================================================
// [0x08~0x44] PMU_LUT_ROW
//=====================================================================================================================
//=============================================================================
// PMU_LUT_ROW[1:0] LUT_TRIG_SEL Define
#define LUT_TRIG_SEL_SHIFT                 (0)
#define LUT_TRIG_SEL_MSK                   ((0x01 << 2) - 1)

