EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/reg_pmu.h
//=============================================================================
// PMU_LUT_ROW[6:2] LUT_TRIG_ID Define
#define LUT_TRIG_ID_SHIFT                  (2)
#define LUT_TRIG_ID_MSK                    ((0x01 << 5) - 1)

//=============================================================================
// PMU_LUT_ROW[10:7] LUT_ACTION Define
#define LUT_ACTION_SHIFT                   (7)
#define LUT_ACTION_MSK                     ((0x01 << 4) - 1)

typedef enum
{
    LUT_TRIG_ID_GPIOA       = (0x00), // GPIO Wakeup without debounce
    LUT_TRIG_ID_GPIOB       = (0x01), // GPIO Wakeup without debounce
    LUT_TRIG_ID_GPIOC       = (0x02), // GPIO Wakeup without debounce
    LUT_TRIG_ID_OTHER       = (0x03)

} PUM_LUT_TRIG_SEL_T;

typedef enum
{
    LUT_TRIG_ID_RTC_CH0      = (0),
    LUT_TRIG_ID_RTC_CH1      = (1),
    LUT_TRIG_ID_RTC_CH2      = (2),
    LUT_TRIG_ID_RTC_CH3      = (3),
    LUT_TRIG_ID_LLC          = (4),
    LUT_TRIG_ID_GTIM0        = (5),
    LUT_TRIG_ID_GTIM1        = (6),
    LUT_TRIG_ID_GTIM2        = (7),
    LUT_TRIG_ID_GTIM3        = (8),
    LUT_TRIG_ID_GPIO         = (9), // GPIO Wakeup with debounce
    LUT_TRIG_ID_CP_SWD       = (10),
    LUT_TRIG_ID_MP_SWD       = (11),
    LUT_TRIG_ID_USB          = (12),
    LUT_TRIG_ID_STIM0_CH0    = (13),
    LUT_TRIG_ID_STIM0_CH1    = (14),
    LUT_TRIG_ID_STIM0_CH2    = (15),
    LUT_TRIG_ID_STIM0_CH3    = (16),
    LUT_TRIG_ID_STIM1_CH0    = (17),
    LUT_TRIG_ID_STIM1_CH1    = (18),
    LUT_TRIG_ID_STIM1_CH2    = (19),
    LUT_TRIG_ID_STIM1_CH3    = (20),
    LUT_TRIG_ID_WDT1         = (21),

} EN_LUT_TRIG_ID_T;

typedef enum
{
    LUT_ACT_PD_SYS_ON       = (0x01 << 0), /* bit[7] */
    LUT_ACT_DCXO_HCLK_ON    = (0x01 << 1), /* bit[8] */
    LUT_ACT_CP_IRQ_EN       = (0x01 << 2), /* bit[9] */
    LUT_ACT_MP_IRQ_EN       = (0x01 << 3), /* bit[10] */

} EN_LUT_ACT_T;

//=====================================================================================================================
// [0x4C](RW) PMU_CLK_SYNC_OUT
//=====================================================================================================================
//=============================================================================
// PMU_CLK_SYNC_OUT[0] RC_HCLK_SYNC_OUT
#define RC_HCLK_SYNC_OUT_SHIFT             (0)
#define RC_HCLK_SYNC_OUT_MSK               ((0x01 << 1) - 1)

typedef enum
{
    RC_HCLK_OUT_STABLE   = 0, // Delay 0.5 to 1.5 32K clock cycles to output RC_HCLK after turn on RC_HCLK.
    RC_HCLK_OUT_QUICKLY  = 1, // Output RC_HCLK while turning on RC_HCLK immediately.

} EN_RC_HCLK_SYNC_OUT_MODE_T;


//=====================================================================================================================
// [0x54](RW) PMU_DCDC_TRIM
//=====================================================================================================================
//=============================================================================
// PMU_DCDC_TRIM[0] DCDC_SLEEP_2_ACT_TIME, From sleep to active
#define DCDC_SLEEP_2_ACT_TIME_SHIFT        (0)
#define DCDC_SLEEP_2_ACT_TIME_MSK          ((0x01 << 1) - 1)

//=============================================================================
// PMU_DCDC_TRIM[1] DCDC_ACT_2_SLEEP_TIME Define, From active to sleep
#define DCDC_ACT_2_SLEEP_TIME_SHIFT        (1)
#define DCDC_ACT_2_SLEEP_TIME_MSK          ((0x01 << 1) - 1)


//=====================================================================================================================
// [0x58](RW) PMU_PSW_CFG
//=====================================================================================================================
//=============================================================================
// PMU_PSW_CFG[3:0] LDO_DIG_PSW_CFG, From ALL digital on to Retention time.
#define LDO_DIG_PSW_CFG_SHIFT              (0)
#define LDO_DIG_PSW_CFG_MSK                ((0x01 << 4) - 1)

//=============================================================================
// PMU_PSW_CFG[7:4] LDO_RET_PSW_CFG, From Retention to ALL digital on time.
#define LDO_RET_PSW_CFG_SHIFT              (4)
#define LDO_RET_PSW_CFG_MSK                ((0x01 << 4) - 1)


//=====================================================================================================================
// [0x5C](RW) PMU_DCXO_HCLK_STABLE_TIME
//=====================================================================================================================
//=============================================================================
// PMU_DCXO_HCLK_STABLE_TIME[7:0] DCXO_HCLK_STABLE_TIME Define (UNIT: 31.25us)
#define DCXO_HCLK_STABLE_TIME_SHIFT        (0)
#define DCXO_HCLK_STABLE_TIME_MSK          ((0x01 << 8) - 1)

#define DCXO_HCLK_STABLE_TIME_MAX_US       (7968) /* 255 * 31.25 = 7,968.75 */


//=====================================================================================================================
// [0x60](WR) PMU_SRAM_RET_EN
//=====================================================================================================================
//=============================================================================
// PMU_SRAM_RET_EN[19:0] SRAM_BLOCK_EN
#define SRAM_BLOCK_EN_SHIT                 (0)
#define SRAM_BLOCK_EN_MSK                  ((0x01 << 20) - 1)

typedef enum
{
    EN_SRAM_BLOCK0   =  0,
    EN_SRAM_BLOCK1   =  1,
    EN_SRAM_BLOCK2   =  2,
    EN_SRAM_BLOCK3   =  3,
    EN_SRAM_BLOCK4   =  4,
    EN_SRAM_BLOCK5   =  5,
    EN_SRAM_BLOCK6   =  6,
    EN_SRAM_BLOCK7   =  7,
    EN_SRAM_BLOCK8   =  8,
    EN_SRAM_BLOCK9   =  9,
    EN_SRAM_BLOCK10  =  10,
    EN_SRAM_BLOCK11  =  11,
    EN_SRAM_BLOCK12  =  12,
    EN_SRAM_BLOCK13  =  13,
    EN_SRAM_BLOCK14  =  14,
    EN_SRAM_BLOCK15  =  15,
    EN_SRAM_BLOCK16  =  16,
    EN_SRAM_BLOCK17  =  17,
    EN_SRAM_BLOCK18  =  18,
    EN_SRAM_BLOCK19  =  19

} EN_SRAM_BLOCK_EN_T;


//=====================================================================================================================
// [0x64](RW) PMU_SLEEP_MODE
//=====================================================================================================================
//=============================================================================
// PMU_SLEEP_MODE[1:0] PWR_MODE_SEL Define
#define PWR_MODE_SEL_SHIFT                 (0)
#define PWR_MODE_SEL_MSK                   ((0x01 << 2) - 1)

