EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/reg_pmu.h
typedef enum
{
    PWR_MODE_SLEEP        = 0, /* SRAM keep retention. */
    PWR_MODE_DEEPSLEEP    = 1, /* SRAM will power down, LCLK clock will keep working(shutdown with 32K). */
    PWR_MODE_HIBERNATION  = 2, /* SRAM will power down, LCLK clock will turn off(shutdown without 32K). */

} EN_PWR_MODE_T;

#define IS_VALID_PWR_MODE(MODE) (((MODE) == PWR_MODE_SLEEP)     \
                              || ((MODE) == PWR_MODE_DEEPSLEEP) \
                              || ((MODE) == PWR_MODE_HIBERNATION))


//=====================================================================================================================
// [0x70](RW) PMU_DCDC_ACT_OUT_EN
//=====================================================================================================================
//=============================================================================
// PMU_DCDC_ACT_OUT_EN[0] DCDC_ACT_OUT_EN Define
#define DCDC_ACT_OUT_EN_SHIFT              (0)
#define DCDC_ACT_OUT_EN_MSK                ((0x01 << 1) - 1)


//=====================================================================================================================
// [0x74](RW) PMU_DCDC_ACT_CFG
//=====================================================================================================================
//=============================================================================
// PMU_DCDC_ACT_CFG[2:0] DCDC_DO_BBM
#define DCDC_DO_BBM_SHIFT                  (0)
#define DCDC_DO_BBM_MSK                    ((0x01 << 3) - 1)

//=============================================================================
// PMU_DCDC_ACT_CFG[5:3] DCDC_ZCD_CMP_HYS
#define DCDC_ZCD_CMP_HYS_SHIFT             (3)
#define DCDC_ZCD_CMP_HYS_MSK               ((0x01 << 3) - 1)

//=============================================================================
// PMU_DCDC_ACT_CFG[8:6] DCDC_OCP_CMP_HYS
#define DCDC_OCP_CMP_HYS_SHIFT             (6)
#define DCDC_OCP_CMP_HYS_MSK               ((0x01 << 3) - 1)

//=============================================================================
// PMU_DCDC_ACT_CFG[11:9] DCDC_TOFF
#define DCDC_TOFF_SHIFT                    (9)
#define DCDC_TOFF_MSK                      ((0x01 << 3) - 1)

//=============================================================================
// PMU_DCDC_ACT_CFG[13:12] DCDC_HYSB
#define DCDC_HYSB_SHIFT                    (12)
#define DCDC_HYSB_MSK                      ((0x01 << 2) - 1)

//=============================================================================
// PMU_DCDC_ACT_CFG[16:14] DCDC_BBM
#define DCDC_BBM_SHIFT                     (14)
#define DCDC_BBM_MSK                       ((0x01 << 3) - 1)

//=============================================================================
// PMU_DCDC_ACT_CFG[19:17] DCDC_PLUSE
#define DCDC_PLUSE_SHIFT                   (17)
#define DCDC_PLUSE_MSK                     ((0x01 << 3) - 1)

//=============================================================================
// PMU_DCDC_ACT_CFG[22:20] DCDC_TON
#define DCDC_TON_SHIFT                     (20)
#define DCDC_TON_MSK                       ((0x01 << 3) - 1)

//=============================================================================
// PMU_DCDC_ACT_CFG[26:23] DCDC_ZCD
#define DCDC_ZCD_SHIFT                     (23)
#define DCDC_ZCD_MSK                       ((0x01 << 4) - 1)

//=============================================================================
// PMU_DCDC_ACT_CFG[30:27] DCDC_OCP
#define DCDC_OCP_SHIFT                     (27)
#define DCDC_OCP_MSK                       ((0x01 << 4) - 1)


//=====================================================================================================================
// [0x78](RW) PMU_DCDC_FB_CFG
//=====================================================================================================================
//=============================================================================
// PMU_DCDC_FB_CFG[6:0] DCDC_FB_HI_VOLT
#define DCDC_FB_HI_VOLT_SHIFT              (0)
#define DCDC_FB_HI_VOLT_MSK                ((0x01 << 7) - 1)

//=============================================================================
// PMU_DCDC_FB_CFG[13:7] DCDC_FB_LO_VOLT
#define DCDC_FB_LO_VOLT_SHIFT              (7)
#define DCDC_FB_LO_VOLT_MSK                ((0x01 << 7) - 1)

typedef enum
{
    EN_DCDC_ACT_VOLT_950mV   = 0x7F,
    EN_DCDC_ACT_VOLT_1000mV  = 0x3F,
    EN_DCDC_ACT_VOLT_1050mV  = 0x1F,
    EN_DCDC_ACT_VOLT_1100mV  = 0x0F,
    EN_DCDC_ACT_VOLT_1150mV  = 0x07,
    EN_DCDC_ACT_VOLT_1200mV  = 0x03,
    EN_DCDC_ACT_VOLT_1250mV  = 0x01,
    EN_DCDC_ACT_VOLT_1300mV  = 0x00,

} EN_DCDC_ACT_VOLT_T;


//=====================================================================================================================
// [0x7C](RW) PMU_DCDC_LPWR_OUT_EN
//=====================================================================================================================
//=============================================================================
// PMU_DCDC_LPWR_OUT_EN[0] DCDC_LPWR_OUT_EN Define
#define DCDC_LPWR_OUT_EN_SHIFT             (0)
#define DCDC_LPWR_OUT_EN_MSK               ((0x01 << 1) - 1)


//=====================================================================================================================
// [0x80](RW) PMU_DCDC_LPWR_ZCD_CFG
//=====================================================================================================================
//=============================================================================
// PMU_DCDC_LPWR_ZCD_CFG[0] DCDC_LPWR_ZCD_LO_SEL
#define DCDC_LPWR_ZCD_LO_SEL_SHIFT         (0)
#define DCDC_LPWR_ZCD_LO_SEL_MSK           ((0x01 << 1) - 1)

//=============================================================================
// PMU_DCDC_LPWR_ZCD_CFG[1] DCDC_LPWR_ZCD_HI_SEL
#define DCDC_LPWR_ZCD_HI_SEL_SHIFT         (1)
#define DCDC_LPWR_ZCD_HI_SEL_MSK           ((0x01 << 1) - 1)

//=============================================================================
// PMU_DCDC_LPWR_ZCD_CFG[2] DCDC_LPWR_ZCD_LO_EN
#define DCDC_LPWR_ZCD_LO_EN_SHIFT          (2)
#define DCDC_LPWR_ZCD_LO_EN_MSK            ((0x01 << 1) - 1)

