EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/reg_pmu.h
//=============================================================================
// PMU_DCDC_LPWR_ZCD_CFG[3] DCDC_LPWR_ZCD_HI_EN
#define DCDC_LPWR_ZCD_HI_EN_SHIFT          (3)
#define DCDC_LPWR_ZCD_HI_EN_MSK            ((0x01 << 1) - 1)


//=====================================================================================================================
// [0x84](RW) PMU_DCDC_LPWR_N_CFG
//=====================================================================================================================
//=============================================================================
// PMU_DCDC_LPWR_N_CFG[15:0] DCDC_LPWR_N_LO
#define DCDC_LPWR_N_LO_SHIFT               (0)
#define DCDC_LPWR_N_LO_MSK                 ((0x01 << 16) - 1)

//=============================================================================
// PMU_DCDC_LPWR_N_CFG[31:16] DCDC_LPWR_N_HI
#define DCDC_LPWR_N_HI_SHIFT               (16)
#define DCDC_LPWR_N_HI_MSK                 ((0x01 << 16) - 1)


//=====================================================================================================================
// [0x88](RW) PMU_DCDC_LPWR_CFG
//=====================================================================================================================
//=============================================================================
// PMU_DCDC_LPWR_CFG[7:0] DCDC_LPWR_P_LO
#define DCDC_LPWR_P_LO_SHIFT               (0)
#define DCDC_LPWR_P_LO_MSK                 ((0x01 << 8) - 1)

//=============================================================================
// PMU_DCDC_LPWR_CFG[15:8] DCDC_LPWR_P_HI
#define DCDC_LPWR_P_HI_SHIFT               (8)
#define DCDC_LPWR_P_HI_MSK                 ((0x01 << 8) - 1)

//=============================================================================
// PMU_DCDC_LPWR_CFG[19:16] DCDC_LPWR_FB_LO
#define DCDC_LPWR_FB_LO_SHIFT              (16)
#define DCDC_LPWR_FB_LO_MSK                ((0x01 << 4) - 1)

//=============================================================================
// PMU_DCDC_LPWR_CFG[23:20] DCDC_LPWR_FB_LO
#define DCDC_LPWR_FB_HO_SHIFT              (20)
#define DCDC_LPWR_FB_HO_MSK                ((0x01 << 4) - 1)

//=============================================================================
// PMU_DCDC_LPWR_CFG[24:26] DCDC_LPWR_BBM
#define DCDC_LPWR_BBM_SHIFT                (24)
#define DCDC_LPWR_BBM_MSK                  ((0x01 << 3) - 1)

typedef enum
{
    EN_DCDC_LPWR_VOLT_950mV  = 0x01,
    EN_DCDC_LPWR_VOLT_1050mV = 0x00,

} EN_DCDC_LPWR_VOLT_T;

//=============================================================================
// PMU_DCDC_LPWR_CFG[23:20] DCDC_LPWR_FB_HI
#define DCDC_LPWR_FB_HI_SHIFT              (20)
#define DCDC_LPWR_FB_HI_MSK                ((0x01 << 4) - 1)

//=============================================================================
// PMU_DCDC_LPWR_CFG[26:24] DCDC_LPWR_BBM
#define DCDC_LPWR_BBM_SHIFT                (24)
#define DCDC_LPWR_BBM_MSK                  ((0x01 << 3) - 1)


//=====================================================================================================================
// [0x8C](RW) PMU_DCDC_LPWR_CLK
//=====================================================================================================================
//=============================================================================
// PMU_DCDC_LPWR_CLK[2:0] DCDC_LPWR_CLK Define  (Range: 1K ~ 32K)
#define DCDC_LPWR_CLK_SHIFT                (0)
#define DCDC_LPWR_CLK_MSK                  ((0x01 << 3) - 1)

typedef enum
{
    EN_DCDC_LPWR_CLK_32K   = 0,    // 32KHz
    EN_DCDC_LPWR_CLK_16K   = 1,    // 16KHz
    EN_DCDC_LPWR_CLK_8K    = 2,    // 8KHz
    EN_DCDC_LPWR_CLK_4K    = 3,    // 4KHz
    EN_DCDC_LPWR_CLK_2K    = 4,    // 2KHz
    EN_DCDC_LPWR_CLK_1K    = 5,    // 1KHz
    EN_DCDC_LPWR_CLK_512   = 6,    // 512Hz
    EN_DCDC_LPWR_CLK_256   = 7,    // 256Hz

} EN_DCDC_LPWR_CLK_T;

#define IS_VALID_DCDC_LPWR_CLK(CLK)   (EN_DCDC_LPWR_CLK_256 >= (CLK))


//=====================================================================================================================
// [0x90](RW) PMU_LDO_ACT_OUT_EN
//=====================================================================================================================
//=============================================================================
// PMU_LDO_ACT_OUT_EN[0] LDO_ACT_OUT_EN Define
#define LDO_ACT_OUT_EN_SHIFT               (0)
#define LDO_ACT_OUT_EN_MSK                 ((0x01 << 1) - 1)


//=====================================================================================================================
// [0x94](RW) PMU_LDO_ACT_CFG
//=====================================================================================================================
//=============================================================================
// PMU_LDO_ACT_CFG[0] LDO_ACT_BYPASS
#define LDO_ACT_BYPASS_SHIFT               (0)
#define LDO_ACT_BYPASS_MSK                 ((0x01 << 1) - 1)

//=============================================================================
// PMU_LDO_ACT_CFG[4:1] LDO_ACT_VOLT
#define LDO_ACT_VOLT_SHIFT                 (1)
#define LDO_ACT_VOLT_MSK                   ((0x01 << 4) - 1)

typedef enum
{
    EN_LDO_ACT_1300mV = 0,
    EN_LDO_ACT_1250mV = 1,
    EN_LDO_ACT_1200mV = 2,
    EN_LDO_ACT_1150mV = 3,
    EN_LDO_ACT_1100mV = 4,
    EN_LDO_ACT_1050mV = 5,
    EN_LDO_ACT_1000mV = 6,
    EN_LDO_ACT_950mV  = 7,

} EN_LDO_ACT_VOLT_T;


//=====================================================================================================================
// [0x98](RW) PMU_LDO_1V8_OUT_EN
//=============================================================================
// PMU_LDO_1V8_OUT_EN[0] LDO_1V8_OUT_EN Define
#define LDO_1V8_OUT_EN_SHIFT               (0)
#define LDO_1V8_OUT_EN_MSK                 ((0x01 << 1) - 1)


//=====================================================================================================================
// [0x9C](RW) PMU_LDO_DIG_OUT_EN
//=============================================================================
// PMU_LDO_DIG_OUT_EN[0] LDO_DIG_OUT_EN Define (KEEP TO 1 ALWAYS)
#define LDO_DIG_OUT_EN_SHIFT               (0)
#define LDO_DIG_OUT_EN_MSK                 ((0x01 << 1) - 1)


