EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/reg_pmu.h
//=====================================================================================================================
// [0xA0](RW) PMU_LDO_DIG_CFG
//=====================================================================================================================
//=============================================================================
// PMU_LDO_DIG_CFG[0] LDO_DIG_BYPASS
#define LDO_DIG_BYPASS_SHIFT               (0)
#define LDO_DIG_BYPASS_MSK                 ((0x01 << 1) - 1)

//=============================================================================
// PMU_LDO_DIG_CFG[3:1] PMU_LDO_DIG_VOLT
#define LDO_DIG_VOLT_SHIFT                 (1)
#define LDO_DIG_VOLT_MSK                   ((0x01 << 3) - 1)

typedef enum
{
    EN_LDO_DIG_1100mV = 0,
    EN_LDO_DIG_1050mV = 1,
    EN_LDO_DIG_1000mV = 2,
    EN_LDO_DIG_950mV  = 3,
    EN_LDO_DIG_900mV  = 4,

} EN_LDO_DIG_VOLT_T;


//=====================================================================================================================
// [0xA8](RW) PMU_LDO_RET_CFG
//=====================================================================================================================
//=============================================================================
// PMU_LDO_RET_CFG[2:0] LDO_RET_ACT_VOLT LDO_RET Output Voltage When system works in Active Mode.
#define LDO_RET_ACT_VOLT_SHIFT             (0)
#define LDO_RET_ACT_VOLT_MSK               ((0x01 << 3) - 1)

//=============================================================================
// PMU_LDO_RET_CFG[5:3] LDO_RET_SLEEP_VOLT LDO_RET Output Voltage When System Works in Sleep Mode.
#define LDO_RET_SLEEP_VOLT_SHIFT           (3)
#define LDO_RET_SLEEP_VOLT_MSK             ((0x01 << 3) - 1)

typedef enum
{
    EN_LDO_RET_1100mV = 0,
    EN_LDO_RET_1050mV = 1,
    EN_LDO_RET_1000mV = 2,
    EN_LDO_RET_950mV  = 3,

} EN_LDO_RET_VOLT_T;


//=====================================================================================================================
// [0xAC](WO) PMU_CLK_CTRL
//=====================================================================================================================
//=============================================================================
// PMU_CLK_CTRL[17:0] PMU_CLK_CTRL Output and Power Define
#define RC_LCLK_OUT_DIS_SHIFT              (0)
#define RC_LCLK_OUT_EN_SHIFT               (1)
#define RC_HCLK_OUT_DIS_SHIFT              (2)
#define RC_HCLK_OUT_EN_SHIFT               (3)
#define DCXO_HCLK_OUT_DIS_SHIFT            (4)
#define DCXO_HCLK_OUT_EN_SHIFT             (5)
#define DCXO_HCLK_PWR_OFF_SHIFT            (6)
#define DCXO_HCLK_PWR_ON_SHIFT             (7)
#define PLL96M_CLK_OUT_DIS_SHIFT           (8)
#define PLL128M_CLK_OUT_DIS_SHIFT          (9)
#define PLL96M_CLK_OUT_EN_SHIFT            (10)
#define PLL128M_CLK_OUT_EN_SHIFT           (11)
#define PLL_CLK_PWR_OFF_SHIFT              (12)
#define PLL_CLK_PWR_ON_SHIFT               (13)

typedef enum
{
    EN_RC_LCLK_OUT_CTRL     = 0,
    EN_RC_HCLK_OUT_CTRL     = 1,
    EN_DCXO_LCLK_OUT_CTRL   = 2,
    EN_DCXO_HCLK_OUT_CTRL   = 3,
    EN_PLL96M_CLK_OUT_CTRL  = 4,
    EN_PLL128M_CLK_OUT_CTRL = 5,

} EN_CLK_OUT_CTRL_T;

typedef enum
{
    EN_DCXO_LCLK_POWER_CTRL = 0,
    EN_DCXO_HCLK_POWER_CTRL = 1,
    EN_PLL_CLK_POWER_CTRL   = 2,

} EN_CLK_POWER_CTRL_T;


//=====================================================================================================================
// [0xB0](RO) PMU_CLK_STATUS
//=====================================================================================================================
//=============================================================================
#define PLL_CLK_PWR_STATUS_SHIFT           (7)
#define PLL128M_CLK_OUT_STATUS_SHIFT       (6)
#define PLL96M_CLK_OUT_STATUS_SHIFT        (5)
#define DCXO_HCLK_OUT_STATUS_SHIFT         (4)
#define DCXO_HCLK_PWR_STATUS_SHIFT         (3)
#define RC_HCLK_OUT_STATUS_SHIFT           (2)
#define RC_HCLK_PWR_STATUS_SHIFT           (1)
#define RC_LCLK_STATUS_SHIFT               (0)

#define PMU_CLK_STATUS_MSK                 ((0x01 << 1) - 1)


//=====================================================================================================================
// [0xB4](RW) PMU_DCXO_HCLK_PWR_SEL
//=====================================================================================================================
//=============================================================================
// PMU_DCXO_HCLK_PWR_SEL[0] DCXO_HCLK_PWR_SEL
#define DCXO_HCLK_PWR_SEL_SHIFT            (0)
#define DCXO_HCLK_PWR_SEL_MSK              ((0x01 << 1) - 1)

typedef enum
{
    EN_DCXO_HCLK_PWR_VDDR      = 0,
    EN_DCXO_HCLK_PWR_DCDC_ACT  = 1,

} EN_DCXO_HCLK_PWR_T;


//=====================================================================================================================
// [0xB8](RW) PMU_DCXO_HCLK_CFG
//=====================================================================================================================
//=============================================================================
// PMU_DCXO_HCLK_CFG[7:0] DCXO_HCLK_CAPR
#define DCXO_HCLK_CAPR_SHIFT               (0)
#define DCXO_HCLK_CAPR_MSK                 ((0x01 << 8) - 1)

//=============================================================================
// PMU_DCXO_HCLK_CFG[15:8] DCXO_HCLK_CAPL
#define DCXO_HCLK_CAPL_SHIFT               (8)
#define DCXO_HCLK_CAPL_MSK                 ((0x01 << 8) - 1)
#define DCXO_HCLK_CAP_3PF                  (30)
#define DCXO_HCLK_CAP_10PF                 (100)
#define DCXO_HCLK_CAP_15PF                 (150)
#define DCXO_HCLK_CAP_28PF5                (285)

//=============================================================================
// PMU_DCXO_HCLK_CFG[18:16] DCXO_HCLK_NGM
#define DCXO_HCLK_NGM_SHIFT                (16)
#define DCXO_HCLK_NGM_MSK                  ((0x01 << 3) - 1)
#define DCXO_HCLK_NGM_3                    (3)

//=============================================================================
// PMU_DCXO_HCLK_CFG[21:19] DCXO_HCLK_IB
#define DCXO_HCLK_IB_SHIFT                 (19)
#define DCXO_HCLK_IB_MSK                   ((0x01 << 3) - 1)
#define DCXO_HCLK_IB_3                     (3)

