EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F675x5_FWLib_V1.0.7f_425/sources/drivers/ht32f675x5_r2/ht32/register/reg_pmu.h
//=============================================================================
// PMU_DCXO_HCLK_CFG[29:22] DCXO_HCLK_BKUP
#define DCXO_HCLK_BKUP_SHIFT               (22)
#define DCXO_HCLK_BKUP_MSK                 ((0x01 << 8) - 1)

typedef struct
{
    uint8_t  u8Ib;
    uint8_t  u8Ngm;
    uint8_t  u8Capl;
    uint8_t  u8Capr;
    uint32_t u32Backup;

} stDCXOParam_t, *pstDcxoParam_t;


//=====================================================================================================================
// [0xBC](RW) PMU_RC_HCLK_TUNE
//=====================================================================================================================
//=============================================================================
// PMU_RC_HCLK_TUNE[7:0] RC_HCLK_TUNE
#define RC_HCLK_TUNE_SHIFT                 (0)
#define RC_HCLK_TUNE_MSK                   ((0x01 << 8) - 1)


//=====================================================================================================================
// [0xC0](RW) PMU_RC_LCLK_TUNE
//=====================================================================================================================
//=============================================================================
// PMU_RC_LCLK_TUNE[7:0] RC_LCLK_TUNE
#define RC_LCLK_TUNE_SHIFT                 (0)
#define RC_LCLK_TUNE_MSK                   ((0x01 << 8) - 1)


//=====================================================================================================================
// [0xC4](RW) PMU_PLL_CFG
//=====================================================================================================================
//=============================================================================
// PMU_PLL_CFG[1:0] PLL_VCO_TUNE
#define PLL_VCO_TUNE_SHIFT                 (0)
#define PLL_VCO_TUNE_MSK                   ((0x01 << 2) - 1)

//=============================================================================
// PMU_PLL_CFG[2] PLL_TEST_EN
#define PLL_TEST_EN_SHIFT                  (2)
#define PLL_TEST_EN_MSK                    ((0x01 << 1) - 1)

//=============================================================================
// PMU_PLL_CFG[3] PLL_DOUBLER_EN
#define PLL_DOUBLER_SHIFT                  (3)
#define PLL_DOUBLER_EN_MSK                 ((0x01 << 1) - 1)


//=====================================================================================================================
// [0xDC](RW) PMU_USB_PHY_SEL
//=====================================================================================================================
//=============================================================================
// PMU_USB_PHY_SEL[1:0] USB_PHY_SEL
#define USB_PHY_SEL_SHIFT                  (0)
#define USB_PHY_SEL_MSK                    ((0x01 << 2) - 1)

typedef enum
{
    USB_PHY_RX_ISO_0  = 0,
    USB_PHY_RX_ISO_1  = 1,
    USB_PHY_RX_ISO_PU = 2,

} EN_USB_PHY_RX_ISO_CFG_T;


//=====================================================================================================================
// [0xE0](RW) PMU_BAND_GAP_CFG
//=====================================================================================================================
//=============================================================================
// PMU_BAND_GAP_CFG[2:0] BAND_GAP_VSUB_CTRL
#define BAND_GAP_VSUB_CTRL_SHIFT           (0)
#define BAND_GAP_VSUB_CTRL_MSK             ((0x01 << 3) - 1)

//=============================================================================
// PMU_BAND_GAP_CFG[4:3] BAND_GAP_VCM_CTRL
#define BAND_GAP_VCM_CTRL_SHIFT            (3)
#define BAND_GAP_VCM_CTRL_MSK              ((0x01 << 2) - 1)


#ifdef __cplusplus
}
#endif

#endif /* __REG_PMU_H__ */


